# Bootstrap (must exist before mise can do anything)
brew "git"
brew "mise"

# Shell + editor foundations
brew "fish"
brew "neovim"
brew "luarocks"
brew "tmux"
brew "direnv"

# macOS-only utilities
brew "trash"
brew "tree"
brew "btop" # aqua-registry has no darwin/arm64 build

# Git ecosystem (brew integration)
brew "git-secrets"

# Casks
cask "alacritty"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "finch"
cask "markedit"

# Security casks
cask "lulu"
cask "blockblock"
cask "knockknock"
cask "malwarebytes"
