# CLI tools
brew "neovim"
brew "luarocks"
brew "fish"
brew "tmux"
brew "gitui"
brew "jq"
brew "ripgrep"
brew "fzf"
brew "zoxide"
brew "glow"
brew "trash"
brew "bat"
brew "fd"
brew "tree"
brew "eza"
brew "uv"
brew "gh"
brew "direnv"
brew "markdownlint-cli2"
brew "git-delta"
brew "atuin"
brew "starship"
brew "yazi"
brew "chafa"
brew "poppler"
brew "btop"
brew "lazygit"
brew "dust"

# AWS
brew "awscli"
brew "aws-sam-cli"
brew "cfn-lint"
brew "cloudformation-guard"

# Security
brew "git-secrets"
brew "trufflehog"
cask "lulu"
cask "blockblock"
cask "knockknock"
cask "malwarebytes"

# Casks
cask "alacritty"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "finch"
cask "markedit"
cask "claude-code"
